<?xml version="1.0"?>
<net name="Model38" version="11">
	<layers>
		<layer id="2" name="a" type="Parameter" version="opset1">
			<data shape="2,128,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="a">
					<dim>2</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="freq" type="Parameter" version="opset1">
			<data shape="1,1,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="freq">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="pos" type="Parameter" version="opset1">
			<data shape="1,1,2" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="pos">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_89983" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="4" name="Split_89984" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_89973" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 32" offset="8" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Divide_89974" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Convert_89970" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_89971" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="136" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Transpose_89972" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Multiply_89975" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_89976" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="160" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_89977" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Cos_89978" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_89980" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="164" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="15" name="Multiply_89981" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Multiply_89986" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Sin_89979" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_89982" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Multiply_89985" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Subtract_89987" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Multiply_89989" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Multiply_89988" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Add_89990" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Concat_89991_out" type="Concat" version="opset1">
			<data axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="out" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="2" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="3" to-layer="22" to-port="0" />
		<edge from-layer="4" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="4" from-port="3" to-layer="19" to-port="0" />
		<edge from-layer="4" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="22" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="2" to-layer="19" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="21" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="24" to-port="0" />
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="2" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0" />
	</edges>
	<rt_info />
</net>
